# Insert Rows with Dictionaries

In [1]:
from DATA225utils import make_connection
from employee import reset_employee, print_employee

In [2]:
conn = make_connection(config_file = 'personnel.ini')
cursor = conn.cursor()

reset_employee(conn)

### Insert one row at a time

In [3]:
sql = ( """
        INSERT INTO employee
        VALUES (%(id)s, %(last)s, %(first)s, %(salary)s)
        """
      ) 

data = {
    'id':     123,
    'first':  'Mary',
    'last':   'Jones',
    'salary': 150_000.00
}

cursor.execute(sql, data)
conn.commit()

### Insert multiple rows

In [4]:
sql = ( """
        INSERT INTO employee
        VALUES (%(id)s, %(last)s, %(first)s, %(salary)s)
        """
      ) 

data = [
    {
        'id':     456,
        'first':  'George',
        'last':   'Smith',
        'salary': 100_000.00
    },
    {
        'id':     789,
        'first':  'Leslie',
        'last':   'Brown',
        'salary': 125_000.00
    },

    {
        'id':     941,
        'first':  'Sidney',
        'last':   'Wilson',
        'salary': 250_000.00
    }
]

cursor.executemany(sql, data)  # NOTE: executemany()
conn.commit()

### Insert specific columns

In [5]:
sql = ( """
        INSERT INTO employee (first, last, id)
        VALUES (%(first)s, %(last)s, %(id)s)
        """
      ) 

data = {
    'id':     604,
    'first':  'Frank',
    'last':   'Schmidt',
    'salary': 50_000
}
    
cursor.execute(sql, data)
conn.commit()

In [6]:
print_employee(conn)

5 rows:

    id     last   first    salary
0  123    Jones    Mary  150000.0
1  456    Smith  George  100000.0
2  604  Schmidt   Frank       NaN
3  789    Brown  Leslie  125000.0
4  941   Wilson  Sidney  250000.0

In [7]:
cursor.close()
conn.close()